[
  {
    "title": "What is FEMA?",
    "desc": "FEMA regulates foreign exchange transactions to promote orderly development of the foreign exchange market in India."
  },
  {
    "title": "Who needs FEMA compliance?",
    "desc": "Individuals and businesses involved in foreign exchange, foreign investment, or cross-border transactions."
  },
  {
    "title": "What are FEMA penalties for non-compliance?",
    "desc": "Penalties include fines and, in severe cases, prosecution under the act."
  },
  {
    "title": "How do I repatriate funds under FEMA?",
    "desc": "Funds can be repatriated through authorized dealers with proper documentation."
  },
  {
    "title": "What is the role of RBI in FEMA?",
    "desc": "RBI acts as the primary regulator issuing guidelines and approvals under FEMA."
  },
  {
    "title": "Is FEMA applicable to NRIs?",
    "desc": "Yes, FEMA governs NRIs' investments, property transactions, and remittances in India."
  },
  {
    "title": "What is an LRS under FEMA?",
    "desc": "Liberalized Remittance Scheme (LRS) allows residents to remit up to $250,000 per financial year for specified purposes."
  },
  {
    "title": "Can foreign companies invest in Indian startups under FEMA?",
    "desc": "Yes, subject to compliance with FEMA and FDI regulations."
  },
  {
    "title": "What are the FEMA guidelines for acquiring property abroad?",
    "desc": "Indian residents can acquire property abroad under LRS or through inherited means."
  },
  {
    "title": "What is an ECB under FEMA?",
    "desc": "External Commercial Borrowings (ECBs) are loans availed by Indian entities from foreign lenders."
  },
  {
    "title": "Are cryptocurrencies covered under FEMA?",
    "desc": "Currently, there is no explicit regulation under FEMA for cryptocurrencies."
  },
  {
    "title": "How do I report foreign investments in India?",
    "desc": "Investments must be reported to RBI through forms like FCGPR or FCTRS."
  },
  {
    "title": "What is FEMA's role in foreign trade?",
    "desc": "FEMA ensures that all foreign trade transactions comply with prescribed guidelines."
  },
  {
    "title": "What are FEMA regulations for outbound investments?",
    "desc": "Outbound investments require prior approval from RBI under FEMA guidelines."
  },
  {
    "title": "How do I regularize FEMA non-compliance?",
    "desc": "Non-compliance can be rectified through compounding applications to the RBI."
  }
]
