[
  {
    "title": "What is the role of ROC Filing?",
    "desc": "ROC Filing oversees the administration of companies registered under the Companies Act, 2013."
  },
  {
    "title": "How do I register my company with ROC Filing?",
    "desc": "File an application through the Ministry of Corporate Affairs (MCA) portal with necessary documents."
  },
  {
    "title": "What are ROC Filing annual compliance requirements?",
    "desc": "Filing of financial statements, annual returns, and other statutory forms."
  },
  {
    "title": "What is the penalty for non-filing of ROC Filing returns?",
    "desc": "Penalties include fines, additional fees, and potential disqualification of directors."
  },
  {
    "title": "Can I change my company name with ROC Filing?",
    "desc": "Yes, a special resolution and ROC Filing approval are required to change the company name."
  },
  {
    "title": "How do I file ROC Filing returns online?",
    "desc": "Returns can be filed on the MCA portal using your company's credentials."
  },
  {
    "title": "What is the due date for ROC filings?",
    "desc": "Typically, annual filings are due within 30 days of the AGM or 180 days from the end of the financial year."
  },
  {
    "title": "What is DIN, and why is it important?",
    "desc": "Director Identification Number (DIN) is mandatory for anyone serving as a director in a company."
  },
  {
    "title": "Can I update my company address with ROC Filing?",
    "desc": "Yes, by filing Form INC-22 and obtaining ROC Filing approval."
  },
  {
    "title": "What is the process for closing a company with ROC Filing?",
    "desc": "File the necessary forms and complete the strike-off process as per MCA guidelines."
  },
  {
    "title": "How do I check my company's compliance status with ROC Filing?",
    "desc": "Compliance status can be checked on the MCA portal using the company CIN."
  },
  {
    "title": "What is ROC Filing's role in mergers and acquisitions?",
    "desc": "ROC Filing ensures compliance during mergers, demergers, or acquisitions under the Companies Act."
  },
  {
    "title": "Are LLPs required to file ROC Filing returns?",
    "desc": "Yes, LLPs must file annual returns and financial statements with ROC Filing."
  },
  {
    "title": "How do I appoint or remove a director with ROC Filing?",
    "desc": "File relevant forms (DIR-12) on the MCA portal for appointment or removal."
  },
  {
    "title": "What is XBRL filing in ROC Filing?",
    "desc": "XBRL (eXtensible Business Reporting Language) is a format for filing financial statements with ROC Filing for certain companies."
  }
]
