[
  {
    "title": "What is the last date for filing income tax returns?",
    "desc": "The deadline varies each year. Typically, it’s July 31 for individuals and October 31 for businesses."
  },
  {
    "title": "What documents are required for filing taxes?",
    "desc": "PAN, Aadhaar, Form 16, investment proofs, bank statements, and salary slips are commonly required."
  },
  {
    "title": "Can I file my taxes without Form 16?",
    "desc": "Yes, you can file taxes by calculating your income and deductions manually."
  },
  {
    "title": "What happens if I miss the tax filing deadline?",
    "desc": "You may face penalties, interest on unpaid taxes, and restrictions on certain financial activities."
  },
  {
    "title": "Can I revise my income tax return after submission?",
    "desc": "Yes, revised returns can be filed before the end of the assessment year."
  },
  {
    "title": "How do I claim deductions under Section 80C?",
    "desc": "You need to provide proof of eligible investments like PPF, ELSS, and others."
  },
  {
    "title": "Can I file taxes online myself?",
    "desc": "Yes, the Income Tax Department provides an e-filing portal, but professional help ensures accuracy."
  },
  {
    "title": "What is the penalty for incorrect tax filing?",
    "desc": "The penalty depends on the severity of the error and the tax laws applicable."
  },
  {
    "title": "Do I need to file taxes if my income is below the taxable limit?",
    "desc": "Filing is not mandatory, but it is advisable for maintaining financial records."
  },
  {
    "title": "How do I know my refund status?",
    "desc": "Refund status can be checked on the Income Tax Department's e-filing portal."
  },
  {
    "title": "Is tax filing mandatory for freelancers and consultants?",
    "desc": "Yes, freelancers and consultants with taxable income must file returns."
  },
  {
    "title": "What is the process for filing taxes for a deceased individual?",
    "desc": "Legal heirs can file the returns on behalf of the deceased."
  },
  {
    "title": "Can I carry forward losses incurred in previous years?",
    "desc": "Yes, business or capital losses can be carried forward to future years."
  },
  {
    "title": "What are the benefits of filing taxes on time?",
    "desc": "Avoid penalties, get faster refunds, and maintain financial credibility."
  },
  {
    "title": "How do I file a rectification request for my tax return?",
    "desc": "Rectification requests can be filed through the e-filing portal under the 'My Account' section."
  }
]
